{
  "nuxtSiteConfig": {
    "name": "Роман Трашутін — Frontend розробник",
    "description": "Персональне портфоліо Романа Трашутіна, Frontend розробника, що спеціалізується на Vue.js та сучасних веб-технологіях. Ознайомтеся з моїми проектами, навичками та досвідом у створенні інтуїтивних та швидких веб-додатків.",
    "titles": {
      "projects": "Проекти",
      "experience": "Досвід",
      "articles": "Статті"
    },
    "descriptions": {
      "projects": "Проекти та роботи Романа Трашутіна",
      "experience": "Професійний досвід та навички у frontend розробці",
      "articles": "Статті та думки про веб-розробку"
    }
  },
  "navbar": {
    "projects": "Мої проекти",
    "experience": "Мій досвід",
    "articles": "Мої статті"
  },
  "themes": {
    "light": "Світла",
    "dark": "Темна",
    "toggle": "Перемкнути тему"
  },
  "statusBlock": {
    "status": "Статус",
    "searching": "Шукаю роботу",
    "hired": "Працюю"
  },
  "heroBlock": {
    "greeting": "Привіт!",
    "name": "Я Роман Трашутін",
    "profession": {
      "prefix": "",
      "title": "Front-End розробник",
      "description": "який любить інтуїтивний, чистий та сучасний UI дизайн."
    },
    "buttons": {
      "contact": "Зв'язатися зі мною",
      "resume": "Моє резюме"
    }
  },
  "aboutMeSection": {
    "title": "Про мене",
    "subtitle": "Дізнайтеся про мене",
    "text": "Я frontend розробник, який захоплюється створенням доступних та pixel-perfect інтерфейсів, що поєднують продуманий дизайн із надійною розробкою. Моя пристрасть — це створення веб-додатків, які не лише привабливі візуально, але й оптимізовані для максимальної продуктивності та зручності використання. Я постійно досліджую нові технології та методології у світі frontend розробки, особливо цікавлюсь екосистемами React та Vue. Моя мета — створювати інтуїтивно зрозумілі інтерфейси, які роблять технології доступнішими для користувачів. Вірю в важливість чистого коду, компонентного підходу та постійного вдосконалення. Кожен проект для мене — це можливість створити щось корисне та вивчити щось нове. У вільний час я займаюся самоосвітою, вивчаю англійську мову та досліджую нові тренди у веб-розробці, адже технології не стоять на місці, і я прагну розвиватися разом з ними.",
    "stackSection": {
      "title": "Мій стек"
    },
    "contactsSection": {
      "title": "Мої контакти",
      "github": "Подивіться мій код",
      "linkedin": "Законектесь зі мною на LinkedIn",
      "email": "Надішліть мені листа",
      "telegram": "Напишіть мені"
    }
  },
  "featuredProjectsSection": {
    "title": "Основні проекти"
  },
  "footer": {
    "nameSurname": "Роман Трашутін",
    "madeWith": "Зроблено з любов'ю.",
    "check": "Перегляньте останні оновлення на GitHub"
  },
  "projects": {
    "title": "Мої проекти",
    "search": {
      "placeholder": "Введіть назву проекта..."
    },
    "sort": {
      "placeholder": "Сортувати за",
      "label": "Сортувати за:",
      "newest": "Найновіші",
      "oldest": "Найстаріші",
      "nameAZ": "Назва (А-Я)",
      "nameZA": "Назва (Я-А)"
    },
    "noResults": "Проекти не знайдені",

    "status": {
      "active": "Активний",
      "archived": "Архівний"
    },
    "created": "Створено:",
    "buttons": {
      "preview": "Живий перегляд",
      "source": "Переглянути код",
      "viewAll": "Переглянути всі проекти"
    },
    "mindenitUi": {
      "title": "Mindenit UI",
      "description": "Бібліотека користувацьких UI-компонентів, заснована на Radix Vue, створена для впровадження єдиних шаблонів UI у проєктах команди Mindenit. Містить детальну документацію та приклади використання."
    },
    "nureScheduleVue": {
      "title": "Nure Schedule (Vue)",
      "description": "Інструмент розкладу для ХНУРЕ, переведений з React на Vue для покращення швидкості завантаження сторінок та чутливості інтерфейсу. Обслуговує понад 2,000 студентів."
    },
    "movieSearch": {
      "title": "Movie Search",
      "description": "Пошукова система для інформації про фільми та серіали, яка надає користувачам детальні дані про популярні фільми та шоу. Проєкт був створений у 2022 році, але завантажений на новий профіль GitHub у 2023 році."
    },
    "codeEditor": {
      "title": "Code Editor",
      "description": "Простий редактор коду з підсвіткою синтаксису та інтерактивним інтерфейсом, що підвищує зручність та доступність для початківців. Проєкт був створений у 2022 році, але завантажений на новий профіль GitHub у 2023 році."
    }
  },
  "experience": {
    "title": "Мій досвід",
    "type": {
      "work": "Робота",
      "education": "Освіта"
    },
    "present": "По теперішній час",

    "mindenit": {
      "title": "Frontend розробник",
      "company": "Mindenit",
      "location": "Харків, Україна",
      "description": "Успішно перебудував та підтримував три великих веб-додатки з аудиторією понад 1000 активних користувачів щомісяця. Досягнув покращення продуктивності на 70% шляхом переходу з React на Vue.js, впровадивши передові методи оптимізації та сучасні практики frontend розробки. Керував розробкою власної UI бібліотеки для забезпечення консистентності між проектами.",
      "link": "Переглянути сайт Mindenit"
    },
    "nure": {
      "title": "Бакалавр комп'ютерної інженерії",
      "company": "ХНУРЕ",
      "location": "Харків, Україна",
      "description": "Наразі навчаюсь за спеціальністю Комп'ютерна інженерія, вивчаючи проектування комп'ютерних систем, діагностику, програмування та інтернет-сервіси. Програма охоплює широкий спектр технологій, включаючи системне адміністрування, розробку мереж та хмарні обчислення.",
      "link": "Переглянути сайт ХНУРЕ"
    },
    "itstep": {
      "title": "Курс розробки програмного забезпечення",
      "company": "IT Step Academy",
      "location": "Краматорськ, Україна",
      "description": "Завершив комплексну 3-річну програму, що охоплює різні аспекти розробки програмного забезпечення, включаючи системне програмування, веб-розробку та дизайн. Успішно закінчив навчання з практичним досвідом у різних мовах програмування та підходах до розробки."
    }
  },
  "articles": {
    "title": "Мої статті",
    "minutesToRead": "хв читання",
    "readMore": "Читати статтю",
    "empty": {
      "title": "Поки що немає статей",
      "description": "Я ще не опублікував жодної статті, але вони скоро з'являться. Слідкуйте за оновленнями!"
    }
  }
}
